In [52]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error,mean_absolute_error,mean_absolute_percentage_error

In [27]:
df =pd.read_csv('insurance.csv')
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [28]:
df=pd.get_dummies(df, columns=["sex","smoker","region"], drop_first=True).astype(int)

In [29]:
df.head()

,age,bmi,children,charges,sex_male,smoker_yes,region_northwest,region_southeast,region_southwest
0,19,27,0,16884,0,1,0,0,1
1,18,33,1,1725,1,0,0,1,0
2,28,33,3,4449,1,0,0,1,0
3,33,22,0,21984,1,0,1,0,0
4,32,28,0,3866,1,0,1,0,0

In [30]:
y=df['charges']
X=df.drop(columns='charges')

In [31]:
lm=LinearRegression()
model=lm.fit(X,y)

In [32]:
model.score(X,y)

0.7508828216439195

In [33]:
model.predict([[19,27,1,1,0,1,0,0]])

C:\Users\LENOVO\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\LocalCache\local-packages\Python312\site-packages\sklearn\base.py:493: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([2265.67150606])

In [34]:
df_hata=pd.DataFrame()

In [35]:
df_hata['y']=y

In [36]:
df_hata

          y
0     16884
1      1725
2      4449
3     21984
4      3866
...     ...
1333  10600
1334   2205
1335   1629
1336   2007
1337  29141

[1338 rows x 1 columns]

In [37]:
y_tahmin= model.predict(X)

In [38]:
df_hata['tahmin']=y_tahmin

In [39]:
df_hata

          y        tahmin
0     16884  25156.523661
1      1725   3340.655590
2      4449   6866.897754
3     21984   3695.166565
4      3866   5466.132057
...     ...           ...
1333  10600  12202.408092
1334   2205   3361.307679
1335   1629   4008.813262
1336   2007   1134.725931
1337  29141  37248.656157

[1338 rows x 2 columns]

In [42]:
df_hata["error"]=y-y_tahmin

In [44]:
df_hata.head(10)

       y        tahmin         error
0  16884  25156.523661  -8272.523661
1   1725   3340.655590  -1615.655590
2   4449   6866.897754  -2417.897754
3  21984   3695.166565  18288.833435
4   3866   5466.132057  -1600.132057
5   3756   3631.622900    124.377100
6   8240  10668.440561  -2428.440561
7   7281   7980.152896   -699.152896
8   6406   8391.943573  -1985.943573
9  28923  11779.945638  17143.054362

In [45]:
df_hata["square_error"]=df_hata["error"]**2

In [46]:
df_hata.head()

       y        tahmin         error  square_error
0  16884  25156.523661  -8272.523661  6.843465e+07
1   1725   3340.655590  -1615.655590  2.610343e+06
2   4449   6866.897754  -2417.897754  5.846230e+06
3  21984   3695.166565  18288.833435  3.344814e+08
4   3866   5466.132057  -1600.132057  2.560423e+06

In [47]:
df_hata["abs_error"]=np.abs(df_hata["error"])

In [48]:
df_hata.head()

       y        tahmin         error  square_error     abs_error
0  16884  25156.523661  -8272.523661  6.843465e+07   8272.523661
1   1725   3340.655590  -1615.655590  2.610343e+06   1615.655590
2   4449   6866.897754  -2417.897754  5.846230e+06   2417.897754
3  21984   3695.166565  18288.833435  3.344814e+08  18288.833435
4   3866   5466.132057  -1600.132057  2.560423e+06   1600.132057

In [49]:
df_hata["percentage_error"]=df_hata["abs_error"]/df_hata["y"]

In [50]:
df_hata.head()

,y,tahmin,error,square_error,abs_error,percentage_error
0,16884,25156.523661,-8272.523661,6.843465e+07,8272.523661,0.489962
1,1725,3340.655590,-1615.655590,2.610343e+06,1615.655590,0.936612
2,4449,6866.897754,-2417.897754,5.846230e+06,2417.897754,0.543470
3,21984,3695.166565,18288.833435,3.344814e+08,18288.833435,0.831916
4,3866,5466.132057,-1600.132057,2.560423e+06,1600.132057,0.413899

In [51]:
df_hata.mean()

y                   1.326993e+04
tahmin              1.326993e+04
error              -5.927350e-13
square_error        3.650633e+07
abs_error           4.170360e+03
percentage_error    4.206582e-01
dtype: float64

In [53]:
mean_squared_error(y,y_tahmin)

np.float64(36506329.65100565)

In [54]:
mean_absolute_error(y,y_tahmin)

np.float64(4170.359803898071)

In [55]:
mean_absolute_percentage_error(y,y_tahmin)

np.float64(0.42065817129070754)